#+TITLE: ~ Process ~

* Ideas On Top of My Mind
** Manipulating ideas by manipulating text
** Tools for thinking about collaborative processes
** Documentation
*** What does it mean for something to be self-documenting?
*** How does documentation tools
** time-based <--> static media 
** The code is the interface is the code
** Creating Spaces
* Projects
** Futurice - Fork Visualiser
*** DONE brainstorm and feasibility study
    :LOGBOOK:
    CLOCK: [2019-09-19 Thu 10:40]--[2019-09-19 Thu 11:27] =>  0:47
    :END:
*** DONE project setup
    :LOGBOOK:
    CLOCK: [2019-09-19 Thu 12:26]--[2019-09-19 Thu 13:31] =>  1:05
    :END:
*** DONE clean up and make initial commit
    :LOGBOOK:
    CLOCK: [2019-09-21 Sat 09:18]--[2019-09-21 Sat 09:40] =>  0:22
    :END:
*** DONE add menu 
    :LOGBOOK:
    CLOCK: [2019-09-21 Sat 10:30]--[2019-09-21 Sat 10:43] =>  0:13
    CLOCK: [2019-09-21 Sat 09:40]--[2019-09-21 Sat 10:24] =>  0:44
    :END:
*** DONE add visualisation
    :LOGBOOK:
    CLOCK: [2019-09-21 Sat 10:51]--[2019-09-21 Sat 13:10] =>  2:19
    :END:
*** Archived tasks 
**** size network nodes relative to repo size
**** provide repo info on node hover
**** migrate visual.vue from js to ts
**** add project to Glitch (was unable to)
    DEADLINE: <2019-09-25 Wed>
    :LOGBOOK:
    CLOCK: [2019-09-25 Wed 14:13]--[2019-09-25 Wed 15:35] =>  1:22
    :END:
** Chasmic
*** DONE org-mode exploration
    SCHEDULED: <2019-09-21 Sat>
*** Rust cli exploration
**** DONE DEADLINE: <2019-09-20 Fri> write about Chasmic 0.1
** Manoeuvre
** Org-Wiki
*** DONE figure out minimum viable way of generating org-like wiki format on your website
    DEADLINE: <2019-09-29 Sun>
    - wrote tutorial markdown parser
    - will build out my org file parser based on this boilerplate
*** DONE parse this file and generate some HTML with your parser
    Deadline: <2019-10-02 Wed>
*** Memex
**** every document can serve as an annotation of another document
**** main document in the center and annotations on either side
***** click on a side an that side becomes the main annotations
***** each section shows multicirectional citations
**** You can have circular annotations 
**** org-like files in a folder.
**** index of all file names and * titles.
**** one can reference any section in the index in capital letters.
**** referenced sections will appear up till 5 lines worth of content on the left and right of the main section.
**** any section can be clicked to view the given section of the specificity of the reference.
**** hashtag indicates the section to be found
**** everything in one org file
**** manual annotation links in the beginning
**** define log structure -> date, type, log
**** project sub header all information on that project kept under that header.
**** easier way of working with long form text?
** Email Check-ins 
*** figure out to send bi-weekly check-in reminder
* Habits
** reflect on top ideas   <2019-09-20 Fri +1d>
* Collaborations
** P
*** Eye
**** DONE make pull request to eye
    DEADLINE: <2019-09-21 Sat>
    :LOGBOOK:
    CLOCK: [2019-09-21 Sat 17:11]--[2019-09-21 Sat 18:24] =>  1:13
    CLOCK: [2019-09-21 Sat 16:26]--[2019-09-21 Sat 16:58] =>  0:32
    :END:
**** authentication
    :LOGBOOK:
     CLOCK: [2019-09-29 Sun 18:17]--[2019-09-29 Sun 19:35] =>  1:18
     CLOCK: [2019-09-27 Fri 10:46]--[2019-09-27 Fri 11:23] =>  0:37
     CLOCK: [2019-09-27 Fri 09:49]--[2019-09-27 Fri 10:16] =>  0:27
     :END:
** X
*** continue work on network visual
SCHEDULED: <2019-09-27 Fri>
**** DONE sent X a reminder.
** E
*** continue work on map 
    SCHEDULED: <2019-09-24 Tue>
** Webring
*** come up with ideas for extending the project 
    SCHEDULED: <2019-09-30 Mon>
** R
*** look into conferences
    SCHEDULED: <2019-10-06 Sun>
*** DONE work on something tangible relating to org-mode tranformations
    SCHEDULED: <2019-09-29 Sun>
    - started writing my parser
*** TODO show R your initial parser project
    SCHEDULED: <2019-10-03 Thu>
* To Remember
** Cherry mx-blues keys are great!
** The last black in SF - movie - Tanna recommended
** Fight Club - book
* To-Learn
** DONE org-mode <2019-09-20 Fri>
*** _General_

C / undo

this is *bold*
this is /italic/
this is _underline_
this is +strikethrough+
this is a link [[http://jskjott.com][my site]]

*** _Caret_

tab local cycling
shift-tab global cycling

C-a move to beginning of line
C-e move to end of line
alt-left/right arrow move by word
alt-up/down move section up/down in doc

C-c C-e run line before caret
C Shift Backspace kill whole line

C-c C-p previous heading
C-c C-f next heading

C-= expand selection

C-w cut
M-w copy
C-y paste

*** _Agenda_

M - x org-agenda

C-c . place new date
C-c C-d insert new deadline
C-c C-s insert schedule item

C-c C-x C-i clock in
C-c C-x C-o clock out

C-c C-c run code block

C-c C-x C-r produce clock report

*** _File actions_

C-c C-s save current buffer

** TODO learn about workaround for lack of 'tail call optimization' in JS [[https://gist.github.com/Gozala/1697037][relevant example]]
   DEADLINE: <2019-09-24 Tue>
** DONE Read about [[https://orgmode.org/worg/dev/org-syntax.html][org-mode syntax]] 
   SCHEDULED: <2019-09-26 Thu>
** DONE learn RC list of front-end topics [[https://github.com/recursecenter/wiki/wiki/Interview-Prep:-Front-End-Topics][front-end topics]] 
   SCHEDULED: <2019-09-25 Wed>
   :LOGBOOK:
   CLOCK: [2019-09-27 Fri 11:35]--[2019-09-27 Fri 11:41] =>  0:06
   :END:
* Todo
** DONE share bun recipe
** DONE Apply to Interactive Things 
   DEADLINE: <2019-09-22 Sun>
*** DONE write cover letter
*** DONE update portfolio
    :LOGBOOK:
    CLOCK: [2019-09-22 Sun 17:10]--[2019-09-22 Sun 17:54] =>  0:44
    CLOCK: [2019-09-22 Sun 13:16]--[2019-09-22 Sun 14:44] =>  1:28
    :END:
*** DONE update resume
    :LOGBOOK:
    CLOCK: [2019-09-23 Mon 23:55]--[2019-09-24 Tue 00:16] =>  0:21
    :END:
** DONE Call V
   DEADLINE: <2019-09-25 Wed>
** TODO apply to [[http://webresidencies-solitude-zkm.com/][solitude and ZKM]] web residency
   DEADLINE: <2019-10-18 Fri>
   :LOGBOOK:
   CLOCK: [2019-10-15 Tue 17:09]--[2019-10-15 Tue 17:35] =>  0:26
   CLOCK: [2019-10-15 Tue 10:33]--[2019-10-15 Tue 10:59] =>  0:26
   :END:
*** How might I extend the webring to encourage community?
** TODO create _Modes of Text_
*** Haggai's book is a treasure throve for getting started!
*** 'Early writing provides the reader with conspicuous help for situating himself imaginatively.' - Orality and Literacy
** DONE put process on jskjott
* Ideas
** building two scaffolds next to each other:  
*** one scaffold is the systems which enable expressionthe other 
*** the other the actual pieces of media and imagining
